app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "price", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "yo"], ["price", 123.0], ["category_id", 1], ["created_at", "2019-04-03 17:05:31.065004"], ["updated_at", "2019-04-03 17:05:31.065004"]]
---
  def create
    @product = Product.new(allowed_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "products" SET "avatar" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["avatar", "#<ActionDispatch::Http::UploadedFile:0x00007fce0c341cf0>"], ["updated_at", "2019-04-16 15:28:20.290305"], ["id", 7]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(allowed_params)