app/views/products/_form.html.haml

      %br/
      = f.collection_select :category_id, Category.order(:name), :id, :name, include_blank: true
    .field
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC